app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:id)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-04-19 19:05:53 UTC], ["updated_at", 2017-04-19 19:05:53 UTC]]